In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame(np.arange(12).reshape((3,4)),
                  index = ['NEW YORK', 'LOS ANG', 'SAN FRAN'],
                  columns = ['A', 'B', 'C', 'D'])

In [3]:
dframe

          A  B   C   D
NEW YORK  0  1   2   3
LOS ANG   4  5   6   7
SAN FRAN  8  9  10  11

In [4]:
dframe.index.map(str.lower)

array(['new york', 'los ang', 'san fran'], dtype=object)

In [5]:
dframe.rename(index=str.title, columns=str.lower)

          a  b   c   d
New York  0  1   2   3
Los Ang   4  5   6   7
San Fran  8  9  10  11

In [7]:
dframe.rename(index={'NEW YORK': 'NY'},
              columns={'A': 'Column1', 'B': 'Column2'})

          Column1  Column2   C   D
NY              0        1   2   3
LOS ANG         4        5   6   7
SAN FRAN        8        9  10  11

In [8]:
dframe

          A  B   C   D
NEW YORK  0  1   2   3
LOS ANG   4  5   6   7
SAN FRAN  8  9  10  11

In [9]:
dframe.rename(index={'NEW YORK': 'NY'},
              columns={'A': 'Column1', 'B': 'Column2'}, inplace=True)

In [10]:
dframe

          Column1  Column2   C   D
NY              0        1   2   3
LOS ANG         4        5   6   7
SAN FRAN        8        9  10  11